# Написать программу нахождения суммы, произведения и среднего арифметического трёх чисел: 5, 7, 3
# Сумма: 15
# Произведение: 105
# Среднее арифметическое: 5.0

a = 5
b = 7
c = 3

print("Сумма: ", a + b + c)
print("Произведение: ", a * b * c)
print("Среднее арифметическое: ", (a + b + c) / 3)

